In [1]:
import pandas as pd
import numpy as np
from math import trunc

In [2]:
df_original = pd.read_csv("./raw.csv", index_col=False,header=None)
columns = [str(i) for i in  range(0, len(list(df_original)))]
df_original.columns = columns

In [3]:
df_original.head()

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,520,EK1520,C539,80733,C53.9,377840000,Tallinn2018,7,3,2007,...,1b,1,0,3B,Harju,Tallinn,3,diagnosed alive,62,1
1,1986,EK2986,C539,82623,C53.9,783313372,Konguta k�la,7,9,2015,...,NaN,NaN,NaN,9,Lõuna,Lõuna,9,diagnosed alive,33,1
2,449,EK1449,C539,89803,C53.9,377840000,Tallinn2018,7,4,2008,...,3,0,0,3,Harju,Tallinn,3,diagnosed alive,65,1
3,578,EK1578,C531,80003,C53.1,443220000,Kohtla-J�rve linn,0,9,2011,...,NaN,NaN,NaN,9,Ida-Viru,Ida-Viru,9,death certificate only,63,0
4,1600,EK2600,C538,80703,C53.8,863895766,Otsa k�la,7,9,2014,...,NaN,NaN,NaN,9,Lõuna,Lõuna,9,diagnosed alive,44,1

In [4]:
#берем только dignosed alive

df = df_original[[
    '3',
    '9',
    '27',
    '17',
    '19',
    '18',
    '25',
    '28',
    '26',
]]
df = df.rename(columns={
    "3": "Code",
    "27": 'Dgnstat',
    "9": "Year", 
    "17": "Nationality",
    "18": "Education",
    "19": "Marital Status", 
    "28": "Age",
    "25": "Residence",
    "26": "Stage"
})

In [5]:
df.head()

,Code,Year,Dgnstat,Nationality,Marital Status,Education,Residence,Age,Stage
0,80733,2007,diagnosed alive,Estonian,divorced,Secondary,Tallinn,62,3
1,82623,2015,diagnosed alive,Estonian,married,University&higher,Lõuna,33,9
2,89803,2008,diagnosed alive,Estonian,widow,Secondary,Tallinn,65,3
3,80003,2011,death certificate only,Russian,divorced,Secondary,Ida-Viru,63,9
4,80703,2014,diagnosed alive,Estonian,divorced,Basic,Lõuna,44,9

In [6]:
df = df.drop(df[df['Dgnstat'] != 'diagnosed alive'].index)

In [7]:
df['Education'] = df['Education'].replace(['Basic', 'Primary'], 'Basic&Primary')

In [8]:
df['Residence'] = df['Residence'].replace(['Tartu'], 'Lõuna')
df['Residence'] = df['Residence'].replace(['Tallinn'], 'Harju')
df['Residence'] = df['Residence'].replace(['Tartu'], 'Lõuna')
df['Residence'] = df['Residence'].replace(['Harju'], 'North')
df['Residence'] = df['Residence'].replace(['Lääne'], 'West')
df['Residence'] = df['Residence'].replace(['Kesk'], 'Central')
df['Residence'] = df['Residence'].replace(['Ida-Viru'], 'North-East')
df['Residence'] = df['Residence'].replace(['Lõuna'], 'South')

In [9]:
df.head()

,Code,Year,Dgnstat,Nationality,Marital Status,Education,Residence,Age,Stage
0,80733,2007,diagnosed alive,Estonian,divorced,Secondary,North,62,3
1,82623,2015,diagnosed alive,Estonian,married,University&higher,South,33,9
2,89803,2008,diagnosed alive,Estonian,widow,Secondary,North,65,3
4,80703,2014,diagnosed alive,Estonian,divorced,Basic&Primary,South,44,9
5,80713,2015,diagnosed alive,Estonian,single,Secondary,Central,52,9

In [10]:

def simpCode(x) :
    x = int(x)/10
    x = trunc(x)
    return x

def groupMicdo(x):

    match x:
        case 8051:
            g = 'SCC'
        case 8052:
            g = 'SCC'
        case 8070:
            g = 'SCC'
        case 8071:
            g = 'SCC'
        case 8072:
            g = 'SCC'
        case 8073:
            g = 'SCC'
        case 8074:
            g = 'SCC'
        case 8076:
            g = 'SCC'
        case 8083:
            g = 'SCC'
        case 8140:
            g = 'AC'  
        case 8201:
            g = 'AC'
        case 8211:
            g = 'AC'
        case 8230:
            g = 'AC'
        case 8260:
            g = 'AC'
        case 8262:
            g = 'AC'
        case 8310:
            g = 'AC'
        case 8380:
            g = 'AC'
        case 8384:
            g = 'AC'
        case 8480:
            g = 'AC'
        case 8482:
            g = 'AC'
        case 8490:
            g = 'AC'
        case 8570:
            g = 'AC'
        case _:
            g = 'Other'
    return g

def groupCode(x) :
    x = int(x)
    if x >= 85603:
        g = 'AC'
    elif x >= 80500 and x <= 80789:
        g = 'SCC'
    elif x >= 80830 and x <= 80849:
        g = 'SCC'
    elif x >= 81400 and x <= 81419:
        g = 'AC'
    elif x >= 81900 and x <= 82119:
        g = 'AC'
    elif x >= 82300 and x <= 82319:
        g = 'AC'
    elif x >= 82600 and x <= 82659:
        g = 'AC'
    elif x >= 83100 and x <= 83109:
        g = 'AC'
    elif x >= 83800 and x <= 83809:
        g = 'AC'
    elif x >= 83820 and x <= 83849:
        g = 'AC'
    elif x >= 84400 and x <= 84909:
        g = 'AC'
    elif x >= 85700 and x <= 85749:
        g = 'AC'
    elif x >= 85760 and x <= 85769:
        g = 'AC'
    else:
        g = 'Unknown' 
    return g

def groupStage(x) :
    x = int(x)
    if x == 1:
        g = 0
    elif x >= 2 and x <= 4:
        g = 1
    else:
        g = 'Unknown'
    return g

def groupPeriod(x) :
    x = int(x)
    if x >= 2007 and x <= 2010:
        g = '2007-2010'
    elif x >= 2011 and x <= 2014:
        g = '2011-2014'
    elif x >= 2015 and x <= 2018:
        g = '2015-2018'
    else:
        g = 'Unknown'
    return g

def groupAge(x) :
    x = int(x)
    if x <= 29:
        g = '<= 29'
    elif x >= 30 and x <= 44:
        g = '30-44'
    elif x >= 45 and x <= 59:
        g = '45-59'
    elif x >= 60 and x <= 74:
        g = '60-74'
    elif x >= 75:
        g = '>= 75'
    return g

def groupNationality(x) :
    if x == 'Russian':
        x = 'Other'
    return x

In [11]:
df["Micdo"] = df['Code'].apply(simpCode)
df["CodeGroup"] = df['Micdo'].apply(groupMicdo)
#df["CodeGroup"] = df['Code'].apply(groupCode)
df["StageGroup"] = df['Stage'].apply(groupStage)
df["Period"] = df['Year'].apply(groupPeriod)
df["AgeGroup"] = df['Age'].apply(groupAge)
df["Nationality"] = df['Nationality'].apply(groupNationality)
df = df.replace(['Unknown', 'unknown', 9], None)
df = df.drop("Dgnstat", axis=1)

In [12]:
df.head()

,Code,Year,Nationality,Marital Status,Education,Residence,Age,Stage,Micdo,CodeGroup,StageGroup,Period,AgeGroup
0,80733,2007,Estonian,divorced,Secondary,North,62,3,8073,SCC,1,2007-2010,60-74
1,82623,2015,Estonian,married,University&higher,South,33,None,8262,AC,None,2015-2018,30-44
2,89803,2008,Estonian,widow,Secondary,North,65,3,8980,Other,1,2007-2010,60-74
4,80703,2014,Estonian,divorced,Basic&Primary,South,44,None,8070,SCC,None,2011-2014,30-44
5,80713,2015,Estonian,single,Secondary,Central,52,None,8071,SCC,None,2015-2018,45-59

In [13]:
df.to_csv('prepared_data.csv', index=False)

In [14]:
df = df.drop(df[df['StageGroup'].isnull()].index)
df.to_csv('prepared_data_with_stages.csv', index=False)

In [15]:
df.Nationality.unique()

array(['Estonian', 'Other', None], dtype=object)

In [16]:
df.Education.unique()

array(['Secondary', 'Basic&Primary', 'University&higher',
       'Secondary_vocational', None], dtype=object)

In [17]:
df.Residence.unique()

array(['North', 'South', 'West', 'Central', 'North-East'], dtype=object)

In [18]:
df.Period.unique()

array(['2007-2010', '2011-2014', '2015-2018'], dtype=object)

In [19]:
df.AgeGroup.unique()

array(['60-74', '45-59', '<= 29', '>= 75', '30-44'], dtype=object)

In [20]:
df.Period.unique()

array(['2007-2010', '2011-2014', '2015-2018'], dtype=object)

In [21]:
df['CodeGroup'].unique()

array(['SCC', 'Other', 'AC'], dtype=object)

In [22]:
df['StageGroup'].unique()

array([1, 0], dtype=object)

In [23]:
df['Micdo'].unique()

array([8073, 8980, 8560, 8070, 8120, 8071, 8072, 8001, 8076, 8480, 8020,
       8140, 8052, 8051, 8211, 8310, 8010, 8890, 8380, 8570, 8384, 8098,
       8262, 8482, 8260, 8804, 8083, 8000, 8230, 8021, 8041, 8246, 9110,
       8990, 9473, 8201, 8074, 8490], dtype=object)

In [24]:
#df.groupby('Micdo').count()
df['Micdo'].value_counts()

8070    455
8072    448
8071    342
8076    153
8140    102
8073     83
8010     37
8000     36
8380     33
8560     27
8384     20
8480     18
8052     16
8310     14
8211     12
8083     12
8001     10
8262      7
8020      6
8021      5
8890      5
8260      4
8570      4
8120      4
8482      3
8980      3
8098      2
8041      2
9110      2
8804      1
8051      1
8230      1
8246      1
8990      1
9473      1
8201      1
8074      1
8490      1
Name: Micdo, dtype: int64

In [25]:
group_df =  df[['Micdo','CodeGroup']].copy()

In [26]:
group_df.head()

   Micdo CodeGroup
0   8073       SCC
2   8980     Other
9   8560     Other
10  8073       SCC
12  8070       SCC

In [27]:
#a = group_df.pivot(index = None, columns=['CodeGroup'], values=['Micdo'])
#a = a.fillna(0)
#a = a.replace(['AC', 'SCC', 'Other'], 1)
#a.head()

In [28]:
ctab = pd.crosstab(group_df['Micdo'], group_df['CodeGroup'])

In [29]:
ctab

CodeGroup   AC  Other  SCC
Micdo
8000         0     36    0
8001         0     10    0
8010         0     37    0
8020         0      6    0
8021         0      5    0
8041         0      2    0
8051         0      0    1
8052         0      0   16
8070         0      0  455
8071         0      0  342
8072         0      0  448
8073         0      0   83
8074         0      0    1
8076         0      0  153
8083         0      0   12
8098         0      2    0
8120         0      4    0
8140       102      0    0
8201         1      0    0
8211        12      0    0
8230         1      0    0
8246         0      1    0
8260         4      0    0
8262         7      0    0
8310        14      0    0
8380        33      0    0
8384        20      0    0
8480        18      0    0
8482         3      0    0
8490         1      0    0
8560         0     27    0
8570         4      0    0
8804         0      1    0
8890         0      5    0
8980         0      3    0
8990         0      1    0
9110         0      2    0
9473         0      1    0

In [30]:
ctab.at['Total', "AC"] = ctab["AC"].sum()
ctab.at['Total', "Other"] = ctab["Other"].sum()
ctab.at['Total', "SCC"] = ctab["SCC"].sum()
print(ctab)

CodeGroup     AC  Other     SCC
Micdo
8000         0.0   36.0     0.0
8001         0.0   10.0     0.0
8010         0.0   37.0     0.0
8020         0.0    6.0     0.0
8021         0.0    5.0     0.0
8041         0.0    2.0     0.0
8051         0.0    0.0     1.0
8052         0.0    0.0    16.0
8070         0.0    0.0   455.0
8071         0.0    0.0   342.0
8072         0.0    0.0   448.0
8073         0.0    0.0    83.0
8074         0.0    0.0     1.0
8076         0.0    0.0   153.0
8083         0.0    0.0    12.0
8098         0.0    2.0     0.0
8120         0.0    4.0     0.0
8140       102.0    0.0     0.0
8201         1.0    0.0     0.0
8211        12.0    0.0     0.0
8230         1.0    0.0     0.0
8246         0.0    1.0     0.0
8260         4.0    0.0     0.0
8262         7.0    0.0     0.0
8310        14.0    0.0     0.0
8380        33.0    0.0     0.0
8384        20.0    0.0     0.0
8480        18.0    0.0     0.0
8482         3.0    0.0     0.0
8490         1.0    0.0     0.0
8560         0.0   27.0     0.0
8570         4.0    0.0     0.0
8804         0.0    1.0     0.0
8890         0.0    5.0     0.0
8980         0.0    3.0     0.0
8990         0.0    1.0     0.0
9110         0.0    2.0     0.0
9473         0.0    1.0     0.0
Total      220.0  143.0  1511.0